app/controllers/authentication_controller.rb

  def login
    user = User.find_by(email:params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'demo@gmail.com' LIMIT 1

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Json Deo', 'json@gmail.com', '$2a$12$tfvozswIIWkHm4Twg.gM2evJjyWzQVKxmjwbOB//D8araVj7KhT7S', '2024-05-09 07:48:35.183646', '2024-05-09 07:48:35.183646')

  def verify_token
    token = request.headers['Authorization']&.split(' ')&.first
    if token
      begin
        decode_token = JWT.decode(token, 'root@123', true, algorithm: 'HS256')
        user = User.find(decode_token[0]['user_id'])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1