app/controllers/webdata_controller.rb

  def save_data
    # Parse request body data
    data = JSON.parse(request.body.read)

    # Find existing or initialize a new WebData record
    web_data = WebData.find_or_initialize_by(id: data['id'])

    p web_data.attributes
    # Update attributes with the parsed data
    web_data.attributes = data

    if web_data.save
---
UPDATE `web_data` SET `web_data`.`url` = 'https://terrell.name', `web_data`.`time` = '{\"chatgpt.com\":633,\"tabId\":\"28\",\"url\":\"https://wade.name\",\"formatedDuration\":\"chatgsadfpdast.com: 1 seconds\"}', `web_data`.`updated_at` = '2024-05-09 12:13:38.037303' WHERE `web_data`.`id` = 12321

  def get_all_data
    # Save the data to MySQL
   web_data = WebData.all
   total_web_data = WebData.count
---
SELECT `web_data`.* FROM `web_data`
SELECT COUNT(*) FROM `web_data`

  def get_web_data_by_id
    web_data = WebData.find_by(id:params[:id])
---
SELECT `web_data`.* FROM `web_data` WHERE `web_data`.`id` = NULL LIMIT 1

  def current_user
    token = request.headers['Authorization']&.split(' ')&.first
    if token
      begin
        decode_token = JWT.decode(token, 'root@123', true, algorithm: 'HS256')
        user = User.find(decode_token[0]['user_id'])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1